Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Сплайн-интерполяция — выявленные пропуски заменяются на промежуточные значения сплайн-функции , полученной по известным значениям;
en: Spline interpolation: detected null data is replaced with the intermediate values of the spline function received using the known values.

source: Способы Детализации:
en: Detailing methods:

source: Способы аутентификации
en: Authentification Methods

source: Способы замен
en: Replacement Methods

source: Способы отображения
en: Representation Methods

source: Способы проверки правильности настройки параметров подключения к LDAP серверу
en: Methods Used to Check Configuration Correctness of the LDAP Server Parameters

source: Способы просмотра номера версии на сервере Loginom средствами ОС аналогичны способам, описанным выше для десктопных редакций, за исключением того, что для удаленного подключения к файловой системе сервера Loginom пользователю необходимы права администратора, а собственно интересующее приложение Loginom – это сервер (C:\Program Files\BaseGroup\Loginom 6\Server\Server.exe).
en: Methods to view the version number on the Loginom server using the OS tools are similar to the methods that are described above for desktop editions. But a user should have administrator rights to get remote access to the Loginom server file system. The Loginom application is a server (C:\Program Files\BaseGroup\Loginom 6\Server\Server.exe).

source: Справа от главного меню располагается рабочий стол.
en: Desktop is located to the right of the main menu.

source: Справа расположен список принимаемых REST-сервисом параметров.
en: The list of the parameters accepted by REST service is located on the right.

source: Справа расположен список принимаемых SOAP-сервисом параметров.
en: The list of the parameters accepted by SOAP service is located on the right.

source: Спроектированный таким образом проект имеет четкую, легко читаемую структуру.
en: The project designed in such a way has a clear and transparent structure.

source: Ср
en: Wednesday

source: Среди значений, не найденных по точному совпадению, производится поиск по регулярным выражениям.
en: The search among the values not found by exact match is performed by regular expressions.

source: Среднее число факторов.
en: Average number of factors.

source: Среднее;
en: Average;

source: Среднеквадратическая ошибка на обучающем множестве (TrainRMSError)
en: The root-mean-square error of the training set (TrainRMSError)

source: Средняя (0,1);
en: Mean (0.1).

source: Средняя (60).
en: Mean (60).

source: Средняя абсолютная ошибка на обучающем множестве (TrainAvgError)
en: The mean absolute error of the training set (TrainAvgError)

source: Средняя относительная ошибка на обучающем множестве (TrainAvgRelError)
en: The mean relative error of the training set (TrainAvgRelError)

source: Средняя перекрестная энтропия на обучающем множестве
en: Average cross-entropy of the training set

source: Средняя скорость.
en: Average speed.

source: Средняя точность.
en: Average accuracy.

source: Средствами ОС
en: By OS Tools

source: Средствами интерфейса
en: By Interface Tools

source: Ссылка на объект
en: Reference to Object

source: Ссылки на входящие поля/переменные и синтаксические конструкции функций можно вставлять в код выражения, выбрав их двойным кликом мыши в соответствующих областях или перетащив мышкой.
en: It is possible to insert references to the input fields/variables and syntactic constructions of functions into the expression code by double click on them in the corresponding areas or by dragging them with the mouse.

source: Ссылки на другие пакеты
en: References to Other Packages

source: Ссылки на измерения, факты и синтаксические конструкции функций можно вставлять в код выражения, выбрав их двойным кликом мыши в соответствующих областях, либо написав вручную.
en: It is possible to insert references to dimensions, measures and syntactic constructions of functions into the expression code by double clicking on them in the corresponding areas or by manual writing.

source: Ссылки на переменные и синтаксические конструкции функций можно вставлять в код выражения, выбрав их двойным кликом мыши в соответствующих областях или перетащив мышкой.
en: It is possible to insert references to variables and syntactic constructions of functions into the expression code by double click on them in the corresponding areas or by dragging them with the mouse.

source: Ссылки на поля/переменные и синтаксические конструкции функций можно вставлять в код выражения, выбрав их двойным кликом мыши в соответствующих областях или перетащив мышкой.
en: It is possible to insert references to the fields/variables and syntactic constructions of functions into the expression code by double click on them in the corresponding areas or by dragging them with the mouse.

source: Ссылки на созданные в Калькуляторе выражения задаются в области кода ручным вводом имени выражения.
en: References to the expressions created in the Calculator can be set in the code area by the manual input of the expression name.

source: Ссылки применяются для подключения других пакетов с целью использования созданных в них производных компонентов и подключений в текущем проекте.
en: The References are used for connection of other packages in order to use the derived components created in them and connections in the current project.

source: Стандартная.
en: Standard.

source: Стандартное отклонение — критерием является отклонение значения признака от среднего более, чем на заданное число стандартных отклонений.
en: Standard deviation: the criterion is deviation of the indicator value from the mean one more than by the set number of standard deviations.

source: Стандартное отклонение;
en: Standard deviation;

source: Стандартные компоненты
en: Standard Components

source: Стандартные компоненты - предоставляются в рамках платформы;
en: Standard components are provided by the platform.

source: Старый\_шаблон - заменяемая подстрока;
en: Old\_template - the replaced substring.

source: Статистическая характеристика распределения случайной величины, показывающая среднюю степень разброса значений величины относительно математического ожидания
en: Statistical characteristics of random distribution that shows the average degree of spread in values relative to statistical expectation

source: Статистические данные таблиц (например, сумма по столбцу, среднее значение и т.д.) при помощи специального обработчика могут быть преобразованы в переменные.
en: The statistical table data (for example, column sum, average value, etc.) can be transformed to variables using the special handler.

source: Статистические показатели (или функции агрегации) при этом вычисляются для каждой группы, а не для всего набора в целом.
en: In this case, the statistical indicators (or aggregation functions) are calculated for each group but not for the whole data set.

source: Статистические показатели:
en: Statistical Indicators:

source: Статистический показатель (Минимум, Максимум, Среднее, Сумма, Стандартное отклонение).
en: Statistical indicator (Minimum, Maximum, Average, Sum, Standard deviation).

source: Статус
en: Status

source: Статус поля:
en: Field status:

source: Степени\_свободы - число степеней свободы.
en: Degrees\_of\_freedom - number of degrees of freedom.

source: Степень - числовое выражение.
en: Degree - numeric expression.

source: Степень - числовое выражение;
en: Degree - numeric expression.

source: Степень регуляризации — параметр, регулирующий жесткость модели.
en: Decay degree enables to adjust the model stiffness.

source: Степень регуляризации — степень зависимости весов сети друг от друга.
en: Decay degree: the degree of the network weights dependence from each other.

source: Степень статистической связи между входной (набором входных) и выходной переменными регрессионной модели
en: Degree of statistic link of the input (set of the input ones) and output variables of regression model

source: Степень статистической связи между входной (набором входных) и выходной переменными регрессионной модели.
en: Degree of statistic link of the input (set of the input one) and output variables of regression model.

source: Столбец присутствует только при редактировании порта, принимающего переменные.
en: The column is available only when editing the port that takes the variables.

source: Столбец присутствует только при редактировании порта, принимающего табличные данные.
en: The column is available only when editing the port that takes the table data.

source: Столбцы генеральной совокупности всегда выше или равны столбцов кластеров.
en: The universal set columns are always higher or equal to the cluster columns.

source: Столбцы и переменные во входных и выходных портах
en: Columns and variables in the input and output ports

source: Столбцы исходного набора данных из списка Информационные.
en: The source data set columns from the Info list.

source: Столбцы кластеров имеют высоту: Количество значений в столбце/Количество значений в столбце генеральной совокупности.
en: Cluster columns have the following height: Number of values in the column/Number of values in the universal set column.

source: Страница JavaScript содержит редактор исполняемого узлом кода.
en: The JavaScript page contains the code editor executed by the node.

source: Страница Разбиение на множества мастера настройки узла позволяет разделить множество на обучающее и тестовое:
en: The Partitioning page of the wizard enables to divide a set into the training and test ones:

source: Стратегия ленивых вычислений предусматривает расчет вычисляемых значений только при необходимости их использования.
en: The strategy of lazy evaluations provides for calculation of the calculated values only if it is required to use them.

source: Стратегия оптимизации
en: Optimization Strategy

source: Стратегия оптимизации следующая:
en: The following optimization strategy is used:

source: Стрелками можно увеличивать или уменьшать тайм-аут с интервалом в 100 миллисекунд.
en: Arrows enable to increase or decrease the timeout at 100 ms interval.

source: Строго возрастающая последовательность границ разбиения.
en: Strictly increasing sequence of binning bounds.

source: Строго постоянное в рамках разбиения одного поля значение, определяющее тип верхней границы диапазона класса - открытая (не включается) или закрытая (включается)
en: Strictly constant value within binning of one field that defines the upper class bin bound type; whether it is open (not included) or close (included).

source: СтройРынок
en: StroyRynok

source: Строка - входная строка.
en: String - the input string.

source: Строка - входная строка;
en: String - the input string.

source: Строка - выражение строкового типа.
en: String - expression of the string type.

source: Строка - строка, в которой ищется подстрока,
en: String - the string in which substring is searched.

source: Строка - строка, в которой необходимо сделать замену;
en: String - the string in which a replacement is required.

source: Строка - строка, для которой расчитывается CRC32 значение.
en: String: the string for which CRC32 value is calculated.

source: Строка - строка, для которой расчитывается MD5 значение.
en: String: the string for which MD5 value is calculated.

source: Строка - строка, для которой расчитывается SHA1 значение.
en: String: the string for which SHA1 value is calculated.

source: Строка - строковое выражение.
en: String - string expression.

source: Строка форматирования: "любой текст %M, еще текст %Y, %G", результат "любой текст Aug, еще текст 2017, 13".
en: Formatting string: "any text %M, another text %Y, %G", result "any Aug text, another text 2017, 13".

source: Строка1,
en: String1.

source: Строка2 - выражения строкового типа.
en: String2 - expressions of the string type.

source: Строка)
en: String)

source: Строка\_формата - строковое выражение специального вида
en: Format\_string - string expression of the special type.

source: Строка\_формата имеет следующий вид: Строка %s Строка [... [Строка%sСтрока]] Строка - строковое выражение %s - символ, на место которого ставится очередное Выражение из списка.
en: Format\_string is represented below: String %s String [... [String%sString]] String - string expression %s - character that is replaced by another Expression from the list.

source: СтрокаЗамены - строка, которая будет вставлена вместо частей входной строки, соответствующих регулярному выражению.
en: ReplaceString - the string that will be inserted instead of the input string parts matching the regular expression.

source: СтрокаЗамены - строка, которая будет вставлена вместо части входной строки, оответствующией регулярному выражению;
en: ReplaceString - the string that will be inserted instead of the input string part matching the regular expression.

source: Строки
en: Strings

source: Строковое представление этих объектов будет соединено в порядке, указанном в списке, и выведено в консоль.
en: The string representation of these objects will be combined in the order specified in the list. It will be output to the console.

source: Структура Проекта может быть представлена в иерархическом виде:
en: The Project structure can be represented in the hierarchic form:

source: Структура модели ARIMAX
en: ARIMAX Model Structure

source: Структура нейросети
en: Neural Network Structure

source: Структура панели следующая:
en: The panel has the following structure:

source: Структура подбирается сразу по всем трем параметрам (число слоев, число нейронов) методом "схождения к вершине" из заданной либо подобранной начальной точки.
en: The structure is selected for all three parameters at once (number of layers, number of neurons) using the "hill climbing" method from the set or selected starting point.

source: Структурный подход
en: Structural Approach

source: Структуру выходного дерева можно загрузить из файла формата XSD с помощью команды Загрузить из XSD...
en: The output tree structure can be loaded from the XSD file using Load from XSD... command.

source: Структуру набора, подаваемого на обработку, можно задать вручную или загрузить из файла *.xsd.
en: It is possible to set the structure of the set supplied for processing in the manual way, or to download it from the *.xsd file.

source: Сумма продаж, тыс.
en: Amount of sales, thous.

source: Сумма продажи
en: Amount of sales

source: Сумма событий и не-событий класса
en: The sum of class events and non-events

source: Сумма строк выборок не может быть больше, чем количество строк в исходной таблице.
en: The sum of the samples rows cannot exceed the row count in the source table.

source: Сумма частных информационных индексов по каждому классу дает общий информационный индекс признака, по которому определяется его значимость.
en: The sum of quotients of information values for each class provides the total information value of the indicator by which its significance is defined.

source: Суть режима заключается в том, что Сценарий запускается без интерфейса и результатом является манипуляции с входными данными (преобразование, передача и выгрузка данных).
en: The point of the mode is that the Workflow is launched without interface. It brings about operations with the input data (transformation, transfer and upload of data).

source: Суть такого преобразования заключается в том, что на основе столбца с информацией о дате/времени формируется один или несколько дополнительных столбцов, в которых выделяется определенная информация о дате/времени.
en: The point of such transformation is that one or several additional columns in which particular information on date/time is selected are generated on the basis of the column with information on date/time.

source: Существует возможность применения уменьшения размера файла при импорте/экспорта.
en: It is possible to decrease the file size when importing/exporting.

source: Существует два метода разбиения:
en: There are two partition methods:

source: Существует несколько вариантов задать опорное значение:
en: There are several options to set the reference value:

source: Существует три вида моделей:
en: There are three model types:

source: Сформированные обработчиком столбцы.
en: The columns generated by the handler.

source: Сценарий выполнит действия:
en: The workflow will perform the following actions:

source: Сценарий может:
en: The Workflow can be distinguished by the following features:

source: Сценарий обработки представляет собой комбинацию узлов обработки данных, настраиваемую пользователем для решения конкретной задачи.
en: The processing workflow is a combination of data processing nodes configured by a user to solve a particular task.

source: Сценарий по умолчанию пустой и заполняется необходимыми компонентами в зависимости от решаемой задачи путем их добавления в область Сценария (см.
en: The workflow is empty by default and it is filled with required components according to the solved task by their adding to the Workflow area (refer to

source: Считается, что те факторы, у которых этот показатель меньше 1, не вносят значительного вклада в объяснение результата.
en: It is considered that the factors with the value less than 1 don't contribute significantly to the result explanation.

source: Считанные данные заменят те, которые уже были в таблице.
en: The imported data will replace the data that have already been in the table.

source: Считываются из настроек системы.
en: It is read from the system settings.

source: Т-статистика
en: T-statistics

source: Т.е. в системе всегда останется хотя бы один действующий локальный администратор, так как администратор с Аутентификацией по LDAP может стать недоступным из-за неправильных настроек или изменений на LDAP сервере.
en: Namely, at least, one active local administrator will always remain in the system as the administrator with the LDAP Authentification can become unavailable due to incorrect settings or changes on the LDAP server.

source: Т.е. по значению текущего столбца отбираются строки, которые определяют внешнее разбиение для поля основного источника данных.
en: Namely, the strings that define the external binning for the main data source field are selected by the current column value.

source: Т.к. модель может работать только с нормализированными данными, то для ее работы необходимо сначала нормализовать данные, которые поступили в модель, а затем провести денормализацию для того, чтобы данные приняли вид, который был до нормализации.
en: As the model can work only with the normalized data, first, it is required to normalize data that has been sent to the model for its usage, and then denormalization must be performed to make data return the same kind it has had before normalization.

source: Т.о.
en: Thus,

source: Та же команда доступна на панели инструментов области построения Сценариев.
en: The same command is available on the toolbar of the Workflows construction area.

source: Таблица данных, состоящая из:
en: The data table that consists of:

source: Таблица замен
en: Replacement Table

source: Таблица имеет следующую структуру:
en: The table has the following structure:

source: Таблица может содержать строки для поиска и замены по:
en: The table can contain rows for search and replacement according to the following requirements:

source: Таблица ответов сервиса;
en: Table of the service responses.

source: Таблица отображает статистические показатели по кластерам (см.
en: The table displays the statistical indicators by clusters (refer to

source: Таблица применимости по этим характеристикам:
en: Applicability table by the following features:

source: Таблица разделена на две части и имеет следующие строки:
en: The table is divided into two areas and includes the following rows:

source: Таблица содержит столбцы:
en: The table contains the columns:

source: Таблица состоит из двух полей:
en: The table consists of two fields:

source: Таблица состоит из следующих полей:
en: The table consists of the following fields:

source: Таблица факторных нагрузок:
en: Table of factor loadings:

source: Таблица факторов:
en: Table of factors:

source: Таблица этой области состоит из нескольких столбцов:
en: The area table consists of several columns:

source: Таблица, состоящая из полей:
en: The table that consists of the following fields:

source: Таблицу условно можно разделить на 2 области:
en: The table can be conventionally divided into 2 areas:

source: Таблицы замен содержат пары заменяемых и новых значений или вычисляющие их регулярные выражения.
en: The replacement tables contain couples of the replaced and new values or regular expressions that enable to compute them.

source: Табличная часть мастера предназначена для отображения исходных данных и диапазона импортируемых ячеек.
en: The table wizard part is designated for display of the source data and range of the imported cells.

source: Табличная часть окна мастера предназначена для настройки параметров импорта для каждого поля набора данных.
en: The table part of the wizard window is designated for configuration of import parameters for each data set field.

source: Так же добавить отчет можно нажав правой кнопкой мыши на необходимом визуализаторе и выбрать пункт меню "Добавить визуализатор в отчеты".
en: It is also possible to add the report by clicking on the required visualizer with the right mouse button. Then it is required to select "Add visualizer to reports" menu option.

source: Так же значения переменных могут использоваться в качестве управляющих переменных для задания параметров настройки узлов.
en: The variables values can be also used as control variables to set parameters of the node settings.

source: Так же узел позволяет кэшировать набор данных целиком, либо отдельные его поля.
en: The node enables to cache the whole data set, or its separate fields.

source: Так же это можно сделать с помощью кнопок : Переместить в Группу Переместить в Группу (комбинация горячих клавиш Alt+G) и Переместить в Показатель Переместить в Показатель (комбинация горячих клавиш Alt+S).
en: It can be also done using the following buttons : Move to Group Move to Group (hotkeys combination - Alt+G) and Move to Parameter Move to Parameter (hotkeys combination - Alt+S).

source: Так как GUID будет генерироваться каждый раз при получении значения выражения, например, при просмотре результата в виде таблицы или при выполнении экспорта данных, то в общем случае рекомендуется при наличии параметра выражения "Кэшировать" включить эту опцию.
en: As GUID will be generated each time when getting the expression value, for example, when viewing result in the tabular form or executing data export, it is generally recommended to activate this option if there is "Cache" expression parameter.

source: Так как случайное число будет генерироваться каждый раз при получении значения выражения, например, при просмотре результата в виде таблицы или при выполнении экспорта данных, то в общем случае рекомендуется при наличии параметра выражения "Кэшировать" включить эту опцию.
en: As a random number will be generated each time when getting the expression value, for example, when viewing result in the tabular form or executing data export, it is generally recommended to activate this option if there is "Cache" expression parameter.
